const azkarList = [
  {
    text: "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ \n \n اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].",
    count: 1,
    fdl: "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.",
  },
  {
    text: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n \n قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.",
    count: 3,
    fdl: "خرجنا في ليلةِ مطرٍ وظلمةٍ شديدةٍ فطلبَ رسولُ اللَّهِ صلَّى اللهُ عليهِ وسلَّمَ فأدركناهُ فقالَ قل قلتُ ما أقولُ قالَ {قُلْ هُوَ اللَّهُ أَحَدٌ} والمعوِّذتينِ حينَ تصبحُ وحينَ تمسي ثلاثَ مرَّاتٍ تكفيكَ من كلِّ شيءٍ ",
  },
  {
    text: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n \n قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
    count: 3,
    fdl: "خرجنا في ليلةِ مطرٍ وظلمةٍ شديدةٍ فطلبَ رسولُ اللَّهِ صلَّى اللهُ عليهِ وسلَّمَ فأدركناهُ فقالَ قل قلتُ ما أقولُ قالَ {قُلْ هُوَ اللَّهُ أَحَدٌ} والمعوِّذتينِ حينَ تصبحُ وحينَ تمسي ثلاثَ مرَّاتٍ تكفيكَ من كلِّ شيءٍ ",
  },
  {
    text: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n \n قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ. ",
    count: 3,
    fdl: "خرجنا في ليلةِ مطرٍ وظلمةٍ شديدةٍ فطلبَ رسولُ اللَّهِ صلَّى اللهُ عليهِ وسلَّمَ فأدركناهُ فقالَ قل قلتُ ما أقولُ قالَ {قُلْ هُوَ اللَّهُ أَحَدٌ} والمعوِّذتينِ حينَ تصبحُ وحينَ تمسي ثلاثَ مرَّاتٍ تكفيكَ من كلِّ شيءٍ ",
  },
  {
    text: "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر. ",
    count: 1,
    fdl: "الدُّعاءُ وذِكرُ اللهِ هو العبادَةُ، وقدْ حثَّنا ربُّنا سُبحانَه على دَوامِ الدُّعاءِ والذِّكرِ",
  },
  {
    text: "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ . ",
    count: 1,
    fdl: "سَيِّدُ الِاسْتِغْفارِ أنْ تَقُولَ: اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ، وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ، وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي؛ فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ. قالَ: ومَن قالَها مِنَ النَّهارِ مُوقِنًا بها، فَماتَ مِن يَومِهِ قَبْلَ أنْ يُمْسِيَ، فَهو مِن أهْلِ الجَنَّةِ، ومَن قالَها مِنَ اللَّيْلِ وهو مُوقِنٌ بها، فَماتَ قَبْلَ أنْ يُصْبِحَ، فَهو مِن أهْلِ الجَنَّةِ.",
  },
  {
    text: "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً. ",
    count: 3,
    fdl: "من قالَ: رَضيتُ باللَّهِ ربًّا، وبالإسلامِ دينًا، وبِمُحمَّدٍ رسولًا، وجَبت لَهُ الجنَّةُ",
  },
  {
    text: "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
    count: 4,
    fdl: "من قالها حين يصبحُ أو يمسي أعتقَ اللهُ ربُعَه من النَّارِ، ومن قالها مرَّتين أعتقَ اللهُ نصفَه من النَّارِ، ومن قالها ثلاثًا أعتقَ اللهُ ثلاثةَ أرباعِه من النَّارِ، فإن قالها أربعًا أعتقَه اللهُ من النَّارِ",
  },
  {
    text: "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
    count: 1,
    fdl: "مَن قالَها حينَ يُصبِحُ فقد أدَّى شُكرَ يومِه، ومن قالَ مثلَ ذلِك حينَ يُمسي، فقد أدَّى شُكرَ ليلتِه",
  },
  {
    text: "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
    count: 7,
    fdl: "مَنْ قالَها فِي كُلّ يَوْمٍ حِينَ يُصْبحُ، وَحِينَ يُمْسِي سَبْعَ مَرَّاتٍ كَفَاهُ اللَّهُ تَعالى ما أهمَّهُ مِنْ أمْرِ الدُّنْيا والآخِرَةِ",
  },
  {
    text: "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
    count: 3,
    fdl: "ما من عبدٍ يقولُ في صباحِ كلِّ يومٍ ومساءِ كلِّ ليلةٍ بسمِ اللَّهِ الَّذي لا يضرُّ معَ اسمِهِ شيءٌ في الأرضِ ولا في السَّماءِ وَهوَ السَّميعُ العليمُ ثلاثَ مرَّاتٍ إلا لم يضرَّهُ شيءٌ",
  },
  {
    text: "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور. ",
    count: 1,
    fdl: "كان النبيُّ صلَّى اللهُ عليه وسلَّمَ يُعلِّمُ أصحابَه جوامعَ الكَلِمِ منَ الدُّعاءِ والكَلِمِ الطيِّبِ، الذي يُذكِّرُ المُسلمَ دائمًا برَبِّه، ويُجدِّدُ له إيمانَه.",
  },
  {
    text: "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
    count: 1,
    fdl: "كان النبيُّ صلَّى اللهُ عليه وسلَّمَ يُعلِّمُ أصحابَه جوامعَ الكَلِمِ منَ الدُّعاءِ والكَلِمِ الطيِّبِ، الذي يُذكِّرُ المُسلمَ دائمًا برَبِّه، ويُجدِّدُ له إيمانَه.",
  },
  {
    text: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
    count: 3,
    fdl: "عن جويرية بنت الحارث رضي الله عنها أن النبي صلى الله عليه وسلم خرج من عندها بكرة حين صلى الصبح وهي في مسجدها ثم رجع بعد أن أضحى وهي جالسة فقال: ما زلت على الحال التي فارقت عليها؟! قالت نعم، قال النبي صلى الله عليه وسلم: لقد قلت بعدك أربع كلمات ثلاث مرات لو وزنت بما قلت منذ اليوم لوزنتهن: سبحان الله وبحمده عدد خلقه ورضى نفسه وزنة عرشه ومداد كلماته.",
  },
  {
    text: "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
    count: 3,
    fdl: "قال عبدالرحمن بن أبي بكرة يا أَبتِ، إنِّي أَسمَعُك تَدْعو كلَّ غَداةٍ: اللَّهمَّ عافِني في بَدَني، اللَّهمَّ عافِني في سَمْعي، اللَّهمَّ عافِني في بَصَري، لا إلهَ إلَّا أنتَ؛ تُعيدُها ثلاثًا حينَ تُصبِحُ، وثَلاثًا حينَ تُمسي؟ فَقال: إنِّي سَمِعتُ رَسولَ اللهِ صلَّى اللهُ عليهِ وسلَّم يَدْعو بِهنَّ، فأَنا أُحِبُّ أن أَستَنَّ بِسُنَّتِه.",
  },
  {
    text: "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
    count: 3,
    fdl: "قال عبَّاسٌ فيهِ: وتَقولُ: اللَّهمَّ إنِّي أَعوذُ بكَ منَ الكُفرِ والفَقرِ، اللَّهمَّ إنِّي أَعوذُ بِكَ مِن عَذابِ القَبرِ، لا إلهَ إلَّا أنتَ، تُعيدُها ثَلاثًا حينَ تُصبِح، وثَلاثًا حينَ تُمسي، فتَدْعو بهِنَّ، فأُحِبُّ أن أَستَنَّ بِسُنَّتِه.",
  },
  {
    text: "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي. ",
    count: 1,
    fdl: "لم يكنْ رسولُ اللهِ صلى الله عليه وسلم يَدَعُ ، أي: يتْرُكُ، هؤلاء الدعواتِ حينَ يُمسي، وحينَ يُصبِحُ :اللهم إني أسألُك العافيةَ في الدنيا والآخرةِ ، اللهم إني أسألُك العفوَ والعافيةَ في ديني ودنياي وأهلي ومالي ، اللهم استرْ عورتي وآمنْ روعاتي ، اللهم احفظْني مِن بين يديَّ ومن خلفي وعن يميني وعن شمالي ومن فوقي ، وأعوذُ بعظمتِك أن أُغتالَ مِن تحتي.",
  },
  {
    text: "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ. ",
    count: 3,
    fdl: "من أعظم الأدعية التي تتضمن تحقيق العبودية لله رب العالمين، وتتضمن التوسل إلى الله تعالى بأسمائه وصفاته، فهو سبحانه الحي القيوم، الرحمن الرحيم، والعبد يستمد العون والتأييد من قيوميته عز وجل، كما يستغيث برحمته التي وسعت كل شيء، لعله ينال منها ما يسعده في دنياه وآخرته.",
  },
  {
    text: "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.",
    count: 1,
    fdl: "كان النبيُّ صلَّى اللهُ عليه وسلَّمَ يُعلِّمُ أصحابَه جوامعَ الكَلِمِ منَ الدُّعاءِ والكَلِمِ الطيِّبِ، الذي يُذكِّرُ المُسلمَ دائمًا برَبِّه، ويُجدِّدُ له إيمانَه.",
  },
  {
    text: "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم. ",
    count: 1,
    fdl: "إن أبا بكر الصديق رضي الله عنه سأل النبي صلى الله عليه وسلم قال: يا رسول الله، علمني ما أقول إذا أصبحت وإذا أمسيت، فقال: يا أبا بكرٍ ! قل : اللهمَّ فاطرَ السماواتِ والأرضِ ، عالمَ الغيبِ والشهادةِ ، ربَّ كلِّ شيءٍ ومليكَه ، أعوذُ بك من شرِّ نفسي ، ومن شرِّ الشيطانِ وشِركِه ، و أن أقترفَ على نفسي سوءًا ، أو أَجُرَّه إلى مسلمٍ",
  },
  {
    text: "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.",
    count: 3,
    fdl: "من قالَ حين يصبحُ أعوذُ بكلماتِ الله التاماتِ من شرِّ ما خلقَ ثلاثَ مراتٍ لم تضرهُ حُمَةٌ حتى يمسِي ، ومن قالها حينَ يمسي لم تضرُّه حتى يصبحَ",
  },
  {
    text: "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.",
    count: 10,
    fdl: "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.",
  },
  {
    text: "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.",
    count: 3,
    fdl: "قال النبي صلى الله عليه وسلم : يا أبا بكرٍ، لَلشِّركُ فيكم أخْفى من دبيبِ النَّملِ، والذي نفسي بيدِه لَلشِّركُ أخْفى من دَبيبِ النَّملِ، ألا أدُلُّك على شيءٍ إذا فعلتَه ذهب عنك قليلهُ وكثيرهُ؟ قل: اللَّهمَّ إنِّي أعوذُ بك أن أُشرِكَ بك وأنا أعلمُ، وأستغفِرُك لما لا أَعلمُ",
  },
  {
    text: "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
    count: 3,
    fdl: "دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ الْمَسْجِدَ، فَإِذَا هُوَ بِرَجُلٍ مِنَ الْأَنْصَارِ يُقَالُ لَهُ: أبو أمامة، فَقَالَ: «يَا أبا أمامة مَالِي أَرَاكَ فِي الْمَسْجِدِ فِي غَيْرِ وَقْتِ الصَّلَاةِ؟» فَقَالَ: هُمُومٌ لَزِمَتْنِي، وَدُيُونٌ يَا رَسُولَ اللَّهِ، فَقَالَ: «أَلَا أُعَلِّمُكَ كَلَامًا إِذَا أَنْتَ قُلْتَهُ أَذْهَبَ اللَّهُ عَزَّ وَجَلَّ هَمَّكَ وَقَضَى دَيْنَكَ؟» قَالَ: قُلْتُ: بَلَى يَا رَسُولَ اللَّهِ، قَالَ: «قُلْ إِذَا أَصْبَحْتَ وَإِذَا أَمْسَيْتَ: اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ» ، قال: فَفَعَلْتُ ذَلِكَ، فَأَذْهَبَ اللَّهُ عَزَّ وَجَلَّ هَمِّي، وَقَضَى عَنِّي دَيْنِي.",
  },
  {
    text: "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
    count: 3,
    fdl: "مَنْ قالَ: أَستغفِرُ اللهَ الَّذي لا إلَهَ إلَّا هو الحيُّ القيُّومُ، وأَتوبُ إليه ثلاثًا، غُفِرتْ له ذُنوبُه، وإنْ كان فارًّا مِنَ الزَّحفِ.",
  },
  {
    text: "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.",
    count: 3,
    fdl: "أنَّ عبدًا مِن عبادِ اللَّهِ قالَ : يا ربِّ لَكَ الحمدُ كما ينبَغي لجلالِ وجهِكَ ولعَظيمِ سُلطانِكَ فعضَّلَت بالملَكَينِ فلم يدِريا كيفَ يَكتبانِها فصعِدا إلى السَّماءِ وقالا يا ربَّنا إنَّ عبدَكَ قد قالَ مقالةً لا نَدري كيفَ نَكتبُها قالَ اللَّهُ عزَّ وجلَّ وَهوَ أعلمُ بما قالَ عبدُهُ ماذا قالَ عَبدي قالا يا ربِّ إنَّهُ قالَ يا ربِّ لَكَ الحَمدُ كما ينبَغي لجلالِ وجهِكَ وعظيمِ سُلطانِكَ فقالَ اللَّهُ عزَّ وجلَّ لَهما : اكتُباها كما قالَ عَبدي حتَّى يلقاني فأجزيَهُ بِها",
  },
  {
    text: "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا.",
    count: 1,
    fdl: "كانَ صلَّى اللهُ عليه يقولُ إذا صلَّى الصُّبحَ حينَ يسلِّمُ اللَّهمَّ إنِّي أسألُكَ عِلمًا نافعًا ورزقًا طيِّبًا وعملًا متقبَّلًا",
  },
  {
    text: "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ. ",
    count: 1,
    fdl: "ذكر طيب.",
  },
  {
    text: "ا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
    count: 7,
    fdl: "قول رَسُول اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: دَعْوَةُ ذِي النُّونِ إِذْ دَعَا وَهُوَ فِي بَطْنِ الحُوتِ: لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ، فَإِنَّهُ لَمْ يَدْعُ بِهَا رَجُلٌ مُسْلِمٌ فِي شَيْءٍ قَطُّ إِلَّا اسْتَجَابَ اللَّهُ لَهُ",
  },
  {
    text: "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ. ",
    count: 100,
    fdl: "مَن قالَ في يومٍ مائةَ مرَّةٍ لا إلَهَ إلَّا اللَّهُ وحدَهُ لا شريكَ لَهُ ، لَهُ الملكُ ولَهُ الحمدُ وَهوَ على كلِّ شيءٍ قديرٌ ، كانَ لَهُ عدلُ عشرِ رقابٍ ، وَكُتِبَت لَهُ مائةُ حَسنةٍ ، ومُحيَ عنهُ مائةُ سيِّئةٍ ، وَكُنَّ لَهُ حِرزًا منَ الشَّيطانِ ، سائرَ يومِهِ إلى اللَّيلِ ، ولم يأتِ أحدٌ بأفضَلَ ممَّا أتى بِهِ ، إلَّا من قالَ أَكْثرَ",
  },
  {
    text: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
    count: 100,
    fdl: "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
  },
  {
    text: "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ",
    count: 100,
    fdl: "مَن لَزِمَ الاستغفارَ ، جعل اللهُ له من كلِّ ضِيقٍ مَخْرَجًا ، ومن كلِّ هَمٍّ فَرَجًا، ورَزَقَهُ من حيثُ لا يَحْتَسِبُ",
  },
  {
    text: "إِنتَهَيت....",
    count: 0,
    fdl: "جَزَاكَ اللَّهُ خَيْرًا وَبَارَكَ اللَّهُ فِيكَ... :)",
  },
];

let currentIndex = 0;
let currentCount = 0;

const zkrText = document.querySelector(".zkr-box p");
const totalCountSpan = document.querySelector(".cont .main");
const currentCountSpan = document.querySelector(".cont .change");
const contDiv = document.querySelector(".cont");
const nextBtn = document.querySelector(".go");
const prevBtn = document.querySelector(".back");
const zikrNumber = document.querySelector(".zkr-box h2 span"); // رقم الذكر الحالي
const fdlText = document.querySelector(".fdl p"); // فضل الذكر

// إضافة أنيميشن للاختفاء والنزول
contDiv.style.transition = "opacity 0.5s ease, transform 0.5s ease";

function updateUI() {
  zkrText.style.transition = "transform 0.5s ease, opacity 0.5s ease";
  zkrText.style.transform = "translateX(-100%)";
  zkrText.style.opacity = "0";

  fdlText.style.transition = "transform 0.5s ease, opacity 0.5s ease";
  fdlText.style.transform = "translateX(-100%)";
  fdlText.style.opacity = "0";

  setTimeout(() => {
    currentCount = 0;
    zkrText.innerHTML = azkarList[currentIndex].text.replace(/\n/g, "<br>"); // استبدال \n بـ <br>
    totalCountSpan.textContent = azkarList[currentIndex].count;
    currentCountSpan.textContent = currentCount;
    fdlText.textContent = azkarList[currentIndex].fdl; // تحديث فضل الذكر

    // تحديث الرقم في h2 span
    zikrNumber.textContent = currentIndex + 1;

    // رجع العناصر من اليمين
    zkrText.style.transform = "translateX(100%)";
    zkrText.style.opacity = "0";

    fdlText.style.transform = "translateX(100%)";
    fdlText.style.opacity = "0";

    setTimeout(() => {
      zkrText.style.transition = "transform 0.5s ease, opacity 0.5s ease";
      zkrText.style.transform = "translateX(0)";
      zkrText.style.opacity = "1";

      fdlText.style.transition = "transform 0.5s ease, opacity 0.5s ease";
      fdlText.style.transform = "translateX(0)";
      fdlText.style.opacity = "1";
    }, 50);

    // التحكم في الأزرار
    prevBtn.style.pointerEvents = currentIndex === 0 ? "none" : "auto";
    prevBtn.style.color = currentIndex === 0 ? "gray" : "#2c356e";

    nextBtn.style.pointerEvents =
      currentIndex === azkarList.length - 1 ? "none" : "auto";
    nextBtn.style.color =
      currentIndex === azkarList.length - 1 ? "gray" : "#2c356e";

    // جعل العداد يختفي بسلاسة مع نزول بسيط
    if (currentIndex === azkarList.length - 1) {
      contDiv.style.opacity = "0"; // يخفي بسلاسة
      contDiv.style.transform = "translateY(20px)"; // يتحرك للأسفل
      setTimeout(() => {
        contDiv.style.visibility = "hidden"; // يخفيه فعليًا بعد الانيميشن
      }, 500);
    } else {
      contDiv.style.visibility = "visible";
      contDiv.style.opacity = "1"; // يرجعه بسلاسة
      contDiv.style.transform = "translateY(0)"; // يرجعه لمكانه
    }
  }, 500);
}

contDiv.addEventListener("click", () => {
  if (currentCount < azkarList[currentIndex].count) {
    currentCount++;
    currentCountSpan.textContent = currentCount;
  }
  if (currentCount === azkarList[currentIndex].count) {
    if (currentIndex < azkarList.length - 1) {
      currentIndex++;
      updateUI();
    }
  }
});

nextBtn.addEventListener("click", () => {
  if (currentIndex < azkarList.length - 1) {
    currentIndex++;
    updateUI();
  }
});

prevBtn.addEventListener("click", () => {
  if (currentIndex > 0) {
    currentIndex--;
    updateUI();
  }
});

// تشغيل أول ذكر
updateUI();
zkrText.style.direction = "rtl";
zkrText.style.textAlign = "center";
fdlText.style.direction = "rtl";
fdlText.style.textAlign = "right";
